<?php

@include_once "english_probes.inc.php";

$moon_name = "Φεγγάρι";
$report_when = "στις";

$top_array = array(
"Πόροι στο" => R_RESOURCES,
"Στόλοι" => F_FLEET,
"Άμυνα" => D_DEFENCE,
"Κτήρια" => B_BUILDINGS,
"Έρευνα" => RS_RESEARCH
);

$probe_array = array(
/*********************************************************************/
/***************************  Resources  *****************************/
/*********************************************************************/
"Μέταλλο" => R_METAL,
"Κρύσταλλο" => R_CRYSTAL,
"Δευτέριο" => R_DEUTERIUM,
"Ενέργεια" => R_ENERGY,

/*********************************************************************/
/*****************************  Fleet   ******************************/
/*********************************************************************/
"Μικρό Μεταγωγικό" => F_SMALLCARGOSHIP,
"Μεγάλο Μεταγωγικό" => F_LARGECARGOSHIP,
"Ελαφρύ Μαχητικό" => F_LIGHFIGHTER,
"Βαρύ Μαχητικό" => F_HEAVYFIGHTER,
"Καταδιωκτικό" => F_CRUISER,
"Καταδρομικό" => F_BATTLESHIP,
"Σκάφος Αποικιοποίησης" => F_COLONYSHIP,
"Ανακυκλωτής" => F_RECYCLER,
"Κατασκοπευτικό Στέλεχος" => F_ESPIONAGEPROBE,
"Βομβαρδιστικό" => F_BOMBER,
"Destroyer" => F_DESTROYER,
"Deathstar" => F_DEATHSTAR,
"Θωρηκτό Αναχαίτισης" => F_BATTLECRUISER,
"Ηλιακοί Συλλέκτες" => F_SOLARSATELLITE,

/*********************************************************************/
/**************************  Defense  ********************************/
/*********************************************************************/
"Εκτοξευτής Πυραύλων" => D_MISSILELAUNCHER,
"Ελαφρύ Λέιζερ" => D_SMALLLASER,
"Βαρύ Λέιζερ" => D_HEAVYLASER,
"Κανόνι Ιόντων" => D_IONCANNON,
"Κανόνι Gauss" => D_GAUSSCANNON,
"Πυργίσκοι Πλάσματος" => D_PLASMACANNON,
"Μικρός Αμυντικός Θόλος" => D_SMALLSHIELDDOME,
"Μεγάλος Αμυντικός Θόλος" => D_LARGESHILDDOME,
"Αντι-Βαλλιστικοί Πύραυλοι" => D_ANTIBALLISTICMISSILE,
"Διαπλανητικοί Πύραυλοι" => D_INTERPLANETARYMISSILE,

/*********************************************************************/
/*****************************  Buildings  ***************************/
/*********************************************************************/
"Ορυχείο Μετάλλου" => B_METALMINE,
"Ορυχείο Κρυστάλλου" => B_CRYSTALMINE,
"Συνθέτης Δευτέριου" => B_DEUTERIUMSYNTHESIZER,
"Εργοστάσιο Ηλιακής Ενέργειας" => B_SOLARPLANT,
"Αντιδραστήρας Σύντηξης" => B_FUSIONPLANT,
"Εργοστάσιο Ρομποτικής" => B_ROBOTFACTORY,
"Εργοστάσιο Νανιτών" => B_NANITEFACTORY,
"Ναυπηγείο" => B_SHIPYARD,
"Αποθήκη Μετάλλου" => B_METALSTORAGE,
"Αποθήκη Κρυστάλλου" => B_CRYSTALSTORAGE,
"Δεξαμενή Δευτέριου" => B_DEUTERIUMTANK,
"Εργαστήριο Ερευνών" => B_RESAERCHLAB,
"Terraformer" => B_TERRAFORMER,
"Σταθμός Συμμαχίας" => B_ALLIANCEDEPOT,
"Σιλό Πυραύλων" => B_ROCKETSILO,
"Σεληνιακή Βάση" => B_LUNARBASE,
"Αισθητήρας Φάλαγγας" => B_SENSORPHALANX,
"Διαγαλαξιακή Πύλη" => B_JUMPGATE,

/*********************************************************************/
/*****************************  Research   ***************************/
/*********************************************************************/
"Τεχνολογία Κατασκοπείας" => RS_ESPIONAGE,
"Τεχνολογία Υπολογιστών" => RS_COMPUTER,
"Τεχνολογία Όπλων" => RS_WEAPON,
"Τεχνολογία Ασπίδων" => RS_SHIELDING,
"Τεχνολογία Θωράκισης" => RS_ARMOUR,
"Τεχνολογία ενέργειας" => RS_ENERGY,
"Υπερδιαστημική Τεχνολογία" => RS_HYPERSPACE,
"Προώθηση Καύσεως" => RS_COMBUSTIONENGINE,
"Ωστική Προώθηση" => RS_IMPULSEENGINE,
"Υπερδιαστημική Προώθηση" => RS_HYPERSPACEENGINE,
"Τεχνολογία Λέιζερ" => RS_LASER,
"Τεχνολογία Ιόντων" => RS_ION,
"Τεχνολογία Πλάσματος" => RS_PLASMA,
"Διαγαλαξιακό Δίκτυο Έρευνας" => RS_IRNETWORK,
"Αστροφυσική" => RS_EXPEDITION,
"Τεχνολογία Βαρυόνιων" => RS_GRAVITON
);

?>