<?php

@include_once "english_probes.inc.php";

$moon_name = "Луна";
$report_when = "Отчет на";

$top_array = array(
"Сырьё на" => R_RESOURCES,
"Флоты" => F_FLEET,
"Оборона" => D_DEFENCE,
"Постройки" => B_BUILDINGS,
"Исследования" => RS_RESEARCH
);

$probe_array = array(
/*********************************************************************/
/***************************  Resources  *****************************/
/*********************************************************************/
"Металл" => R_METAL,
"Кристалл" => R_CRYSTAL,
"Дейтерий" => R_DEUTERIUM,
"Энергия" => R_ENERGY,

/*********************************************************************/
/*****************************  Fleet   ******************************/
/*********************************************************************/
"Малый транспорт" => F_SMALLCARGOSHIP,
"Большой транспорт" => F_LARGECARGOSHIP,
"Лёгкий истребитель" => F_LIGHFIGHTER,
"Тяжёлый истребитель" => F_HEAVYFIGHTER,
"Крейсер" => F_CRUISER,
"Линкор" => F_BATTLESHIP,
"Колонизатор" => F_COLONYSHIP,
"Переработчик" => F_RECYCLER,
"Шпионский зонд" => F_ESPIONAGEPROBE,
"Бомбардировщик" => F_BOMBER,
"Уничтожитель" => F_DESTROYER,
"Звезда смерти" => F_DEATHSTAR,
"Линейный крейсер" => F_BATTLECRUISER,
"Солнечный спутник" => F_SOLARSATELLITE,

/*********************************************************************/
/**************************  Defense  ********************************/
/*********************************************************************/
"Ракетная установка" => D_MISSILELAUNCHER,
"Лёгкий лазер" => D_SMALLLASER,
"Тяжёлый лазер" => D_HEAVYLASER,
"Ионное орудие" => D_IONCANNON,
"Пушка Гаусса" => D_GAUSSCANNON,
"Плазменное орудие" => D_PLASMACANNON,
"Малый щитовой купол" => D_SMALLSHIELDDOME,
"Большой щитовой купол" => D_LARGESHILDDOME,
"Ракета-перехватчик" => D_ANTIBALLISTICMISSILE,
"Межпланетная ракета" => D_INTERPLANETARYMISSILE,

/*********************************************************************/
/*****************************  Buildings  ***************************/
/*********************************************************************/
"Рудник по добыче металла" => B_METALMINE,
"Рудник по добыче кристалла" => B_CRYSTALMINE,
"Синтезатор дейтерия" => B_DEUTERIUMSYNTHESIZER,
"Солнечная электростанция" => B_SOLARPLANT,
"Термоядерная электростанция" => B_FUSIONPLANT,
"Фабрика роботов" => B_ROBOTFACTORY,
"Фабрика нанитов" => B_NANITEFACTORY,
"Верфь" => B_SHIPYARD,
"Хранилище металла" => B_METALSTORAGE,
"Хранилище кристалла" => B_CRYSTALSTORAGE,
"Ёмкость для дейтерия" => B_DEUTERIUMTANK,
"Исследовательская лаборатория" => B_RESAERCHLAB,
"Терраформер" => B_TERRAFORMER,
"Склад альянса" => B_ALLIANCEDEPOT,
"Ракетная шахта" => B_ROCKETSILO,
"Лунная база" => B_LUNARBASE,
"Сенсорная фаланга" => B_SENSORPHALANX,
"Ворота" => B_JUMPGATE,

/*********************************************************************/
/*****************************  Research   ***************************/
/*********************************************************************/
"Шпионаж" => RS_ESPIONAGE,
"Компьютерная технология" => RS_COMPUTER,
"Оружейная технология" => RS_WEAPON,
"Щитовая технология" => RS_SHIELDING,
"Броня космических кораблей" => RS_ARMOUR,
"Энергетическая технология" => RS_ENERGY,
"Гиперпространственная технология" => RS_HYPERSPACE,
"Реактивный двигатель" => RS_COMBUSTIONENGINE,
"Импульсный двигатель" => RS_IMPULSEENGINE,
"Гиперпространственный двигатель" => RS_HYPERSPACEENGINE,
"Лазерная технология" => RS_LASER,
"Ионная технология" => RS_ION,
"Плазменная технология" => RS_PLASMA,
"Межгалактическая исследовательская сеть" => RS_IRNETWORK,
"Астрофизика" => RS_EXPEDITION,
"Гравитационная технология" => RS_GRAVITON
);


?>