<?php

@include_once "english_probes.inc.php";

$moon_name = "месец";
$report_when = "дана";

$top_array = array(
"Ресурси на" => R_RESOURCES,
"флоте" => F_FLEET,
"Одбрана" => D_DEFENCE,
"Зграда" => B_BUILDINGS,
"Истраживање" => RS_RESEARCH
);

$probe_array = array(
/*********************************************************************/
/***************************  Resources  *****************************/
/*********************************************************************/
"Метал" => R_METAL,
"Кристал" => R_CRYSTAL,
"Деутеријум" => R_DEUTERIUM,
"Енергија" => R_ENERGY,

/*********************************************************************/
/*****************************  Fleet   ******************************/
/*********************************************************************/
"Mali transporter" => F_SMALLCARGOSHIP,
"Veliki transporter" => F_LARGECARGOSHIP,
"Mali lovac" => F_LIGHFIGHTER,
"Veliki lovac" => F_HEAVYFIGHTER,
"Крстарица" => F_CRUISER,
"Борбени брод" => F_BATTLESHIP,
"Колонизациони брод" => F_COLONYSHIP,
"Рециклер" => F_RECYCLER,
"Шпијунске сонде" => F_ESPIONAGEPROBE,
"Бомбардер" => F_BOMBER,
"Разарач" => F_DESTROYER,
"Звезда Смрти" => F_DEATHSTAR,
"Оклопна крстарица" => F_BATTLECRUISER,
"Соларни Сателит" => F_SOLARSATELLITE,

/*********************************************************************/
/**************************  Defense  ********************************/
/*********************************************************************/
"Ракетобацач" => D_MISSILELAUNCHER,
"Мали Ласер" => D_SMALLLASER,
"Велики Ласер" => D_HEAVYLASER,
"Јонски топ" => D_IONCANNON,
"Гаусов топ" => D_GAUSSCANNON,
"Плазма топ" => D_PLASMACANNON,
"Мала купола" => D_SMALLSHIELDDOME,
"Велика Купола" => D_LARGESHILDDOME,
"Антибалистичке ракете" => D_ANTIBALLISTICMISSILE,
"Интерпланетарне ракете" => D_INTERPLANETARYMISSILE,

/*********************************************************************/
/*****************************  Buildings  ***************************/
/*********************************************************************/
"Рудник Метала" => B_METALMINE,
"Рудник кристала" => B_CRYSTALMINE,
"Синтетизер Деутеријума" => B_DEUTERIUMSYNTHESIZER,
"Соларна Електрана" => B_SOLARPLANT,
"Фузиони реактор" => B_FUSIONPLANT,
"Фабрика робота" => B_ROBOTFACTORY,
"Фабрика нанита" => B_NANITEFACTORY,
"Бродоградилиште" => B_SHIPYARD,
"Складиште метала" => B_METALSTORAGE,
"Складиште кристала" => B_CRYSTALSTORAGE,
"Складиште Деутеријума" => B_DEUTERIUMTANK,
"Истраживачка лаб." => B_RESAERCHLAB,
"Тераформер" => B_TERRAFORMER,
"Депо савеза" => B_ALLIANCEDEPOT,
"Силос за ракете" => B_ROCKETSILO,
"Свемирска база" => B_LUNARBASE,
"Сензор Фаланга" => B_SENSORPHALANX,
"Одскочна капија" => B_JUMPGATE,

/*********************************************************************/
/*****************************  Research   ***************************/
/*********************************************************************/
"Тех. за шпијунажу" => RS_ESPIONAGE,
"Тех. за компјутере" => RS_COMPUTER,
"Технологија оружја" => RS_WEAPON,
"Тех. за штитове" => RS_SHIELDING,
"Тех. за оклоп" => RS_ARMOUR,
"Технологија за енергију" => RS_ENERGY,
"Тех. за хиперзону" => RS_HYPERSPACE,
"Мех. сагоревања" => RS_COMBUSTIONENGINE,
"Импулсни погон" => RS_IMPULSEENGINE,
"Хиперспејс Погон" => RS_HYPERSPACEENGINE,
"Тех. за ласере" => RS_LASER,
"Технологија јона" => RS_ION,
"Тех. за плазму" => RS_PLASMA,
"Интергал. Истраживачка Мр." => RS_IRNETWORK,
"Астрофизика" => RS_EXPEDITION,
"Тех. за гравитоне" => RS_GRAVITON
);

?>